app/Controllers/BlogController.php

    public function index()
    {
        $data = [];

        $BlogModel = new BlogModel();
        $data = [
            'all_blogs' => $BlogModel->orderBy('blog.id', 'desc')->paginate(6),
            'pager' => $BlogModel->pager,
        ];
---
SELECT *
FROM `blog`
ORDER BY `blog`.`id` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `blog`