app/Controllers/CareerController.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `career_table`.*, COUNT(course_table.coursecareer) as total_courses
FROM `career_table`
JOIN `course_table` ON `career_table`.`careerId` = `course_table`.`coursecareer`
GROUP BY `career_table`.`careerId`, `career_table`.`careerName`
) CI_count_all_results
SELECT `career_table`.*, COUNT(course_table.coursecareer) as total_courses
FROM `career_table`
JOIN `course_table` ON `career_table`.`careerId` = `course_table`.`coursecareer`
GROUP BY `career_table`.`careerId`, `career_table`.`careerName`
ORDER BY `career_table`.`careerId` DESC
 LIMIT 5
---
    public function index()
    {
        $data = [];

        $careerModel = new CareerModel();
    // Assuming $careerModel is your Career model

        $data = [
            'career_data' => $careerModel
                                ->select('career_table.*, COUNT(course_table.coursecareer) as total_courses')
                                ->join('course_table', 'career_table.careerId = course_table.coursecareer')
                                ->groupBy('career_table.careerId, career_table.careerName')
                                ->orderBy('career_table.careerId', 'desc')
                                ->paginate(5),
            'pager' => $careerModel->pager,
        ];