app/Controllers/CertificateController.php

    public function index()
    {
        $data = [];

         // highlight the career nave py passing the page name
         $data['passedLink'] = "certificates";

         $courses = new CourseModel();
         $certificateModel  = new CertificateModel();

         $data['certificates'] = $certificateModel->orderBy('dateAdded', 'desc')->findAll();
---
SELECT *
FROM `certificates`
ORDER BY `dateAdded` DESC

    public function view_certificate($cert_id){
        // highlight the career nave py passing the page name
        $data['passedLink'] = "certificates";

        $courses = new CourseModel();
        $certificateModel  = new CertificateModel();

        $data['certificate'] = $certificateModel->where("certId", $cert_id)->find();
---
SELECT *
FROM `certificates`
WHERE `certId` = 'X88DvB'

    public function vfy($certificate_serial){

        $data['request'] = [];

        $courses = new CourseModel();
        $certificateModel  = new CertificateModel();

        if($certificate_serial == 'v'){
            $data['request'] = "verify_certificate";
        }else{
            $data['certificate'] = $certificateModel->where("certId", $certificate_serial)->find();
---
SELECT *
FROM `certificates`
WHERE `certId` = 'X88DvB'