app/Controllers/CourseController.php

       public function index()
       {
           $data = [];
           // get all the courses
           $courseModel = new courseModel();

            $data = [
                'course_data' => $courseModel
                                ->join('career_table', 'career_table.careerId = course_table.coursecareer')
                                ->groupBy('course_table.courseId')
                                ->orderBy('course_table.courseId', 'desc')
                                ->paginate(4),
                'pager' => $courseModel->pager,
            ];
            // this will highlight the couse link as active
           $data['passedLink'] = "course";

           // get all the career items
           $careerModel = new careerModel();
           $data['career_data'] = $careerModel->findAll();
---
SELECT *
FROM `course_table`
JOIN `career_table` ON `career_table`.`careerId` = `course_table`.`coursecareer`
GROUP BY `course_table`.`courseId`
ORDER BY `course_table`.`courseId` DESC
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM (
SELECT *
FROM `course_table`
JOIN `career_table` ON `career_table`.`careerId` = `course_table`.`coursecareer`
GROUP BY `course_table`.`courseId`
) CI_count_all_results
SELECT *
FROM `career_table`

           public function view_courses(){

            $data = [];
            // get all the courses
            $courseModel = new courseModel();

             $data = [
                 'course_data' => $courseModel
                                 ->join('career_table', 'career_table.careerId = course_table.coursecareer')
                                 ->groupBy('course_table.courseId')
                                 ->orderBy('course_table.courseId', 'desc')
                                 ->paginate(6),
                 'pager' => $courseModel->pager,
             ];
---
SELECT *
FROM `course_table`
JOIN `career_table` ON `career_table`.`careerId` = `course_table`.`coursecareer`
GROUP BY `course_table`.`courseId`
ORDER BY `course_table`.`courseId` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM (
SELECT *
FROM `course_table`
JOIN `career_table` ON `career_table`.`careerId` = `course_table`.`coursecareer`
GROUP BY `course_table`.`courseId`
) CI_count_all_results

           public function course_details($courseId){
            $data = [];
            // get all the courses
            $courseModel = new courseModel();
            $careerModel = new CareerModel();

            if(!empty(!$courseId) && !is_int($courseId) && !$courseModel->find($courseId)){
                return redirect()->to('/course')->with('error', 'an error occured while adding a course. ');
            }
            $BlogModel = new BlogModel();
            $data['latest_blog_post'] = $BlogModel->recent_blogs();

            $data['course_details'] = $courseModel->find($courseId);// course details

            $data['careerPaths'] = $careerModel
                                    ->select('career_table.*, COUNT(course_table.coursecareer) as total_courses')
                                    ->join('course_table', 'career_table.careerId = course_table.coursecareer')
                                    ->groupBy('career_table.careerId, career_table.careerName')
                                    ->orderBy('career_table.careerId', 'desc')
                                    ->paginate(5);

            $data['similar_courses'] = $courseModel->where('coursecareer',$data['course_details']['coursecareer'])->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `career_table`.*, COUNT(course_table.coursecareer) as total_courses
FROM `career_table`
JOIN `course_table` ON `career_table`.`careerId` = `course_table`.`coursecareer`
GROUP BY `career_table`.`careerId`, `career_table`.`careerName`
) CI_count_all_results
SELECT `career_table`.*, COUNT(course_table.coursecareer) as total_courses
FROM `career_table`
JOIN `course_table` ON `career_table`.`careerId` = `course_table`.`coursecareer`
GROUP BY `career_table`.`careerId`, `career_table`.`careerName`
ORDER BY `career_table`.`careerId` DESC
 LIMIT 5
SELECT *
FROM `course_table`
WHERE `coursecareer` = '4'