app/Controllers/DashboardController.php

    public function index()
    {
        $career = new CareerModel();
        $courses = new CourseModel();
        $testimonials = new TestimonialsModel();
        $team = new TeamModel();
        $blog = new BlogModel();
        $visitors = new VisitorsModel();
        $certificate = new CertificateModel();
        $subscribers = new SubscrsiberModel();


        $data = [
            'career' => $career->findAll(),
            'courses' => $courses->findAll(),
            'testimonials' => $testimonials->findAll(),
            'team' => $team->findAll(),
            'visitors' => $visitors->findAll(),
            'blog' => $blog->findAll(),
            'certificate' => $certificate->findAll(),
            'subscribers' => $subscribers->findAll(),
        ];
---
SELECT *
FROM `team`
SELECT *
FROM `blog`
SELECT *
FROM `testimonials`
SELECT *
FROM `visitors`
SELECT *
FROM `certificates`
SELECT *
FROM `subscribers`