app/Controllers/PublicController.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `career_table`.*, COUNT(course_table.coursecareer) as total_courses
FROM `career_table`
JOIN `course_table` ON `career_table`.`careerId` = `course_table`.`coursecareer`
GROUP BY `career_table`.`careerId`, `career_table`.`careerName`
) CI_count_all_results
SELECT `career_table`.*, COUNT(course_table.coursecareer) as total_courses
FROM `career_table`
JOIN `course_table` ON `career_table`.`careerId` = `course_table`.`coursecareer`
GROUP BY `career_table`.`careerId`, `career_table`.`careerName`
ORDER BY `career_table`.`careerId` DESC
 LIMIT 10
SELECT *
FROM `course_table`
JOIN `career_table` ON `career_table`.`careerId` = `course_table`.`coursecareer`
GROUP BY `course_table`.`courseId`
ORDER BY `course_table`.`courseId` DESC
 LIMIT 6
---
    public function index()
    {
        $data = [];
        $TestimonialsModel = new TestimonialsModel();


        $careerModel = new careerModel();
    // Assuming $careerModel is your Career model

        $data = [
            'career_pathways' => $careerModel
                                ->select('career_table.*, COUNT(course_table.coursecareer) as total_courses')
                                ->join('course_table', 'career_table.careerId = course_table.coursecareer')
                                ->groupBy('career_table.careerId, career_table.careerName')
                                ->orderBy('career_table.careerId', 'desc')
                                ->paginate(10),
            'pager' => $careerModel->pager,
        ];
        $courseModel = new CourseModel();
        $data['course_data'] =  $courseModel
                                 ->join('career_table', 'career_table.careerId = course_table.coursecareer')
                                 ->groupBy('course_table.courseId')
                                 ->orderBy('course_table.courseId', 'desc')
                                 ->limit(6)
                                 ->get()
                                 ->getResult();

SELECT *
FROM `testimonials`
ORDER BY `id` DESC
 LIMIT 10
---
        $data['latest_blog_post'] = $BlogModel->recent_blogs();

        // testimonial
        $data['testimonials_rescent'] = $TestimonialsModel->orderBy('id', 'desc')->limit(10)->get()->getResult();