app/Controllers/TestimonialsController.php

SELECT *
FROM `testimonials`
---
    public function index(){

      $data = [];

      $data['passedLink'] = "testimonials";
        $data['userData'] = session()->get('userData');

      $testimonialModel = new TestimonialsModel();
      $data['all_testimonials'] = $testimonialModel->findAll();