app/Models/BlogModel.php

public function recent_blogs()
  {
      $query = $this->db->table('blog')
              ->select('blog_comments.*, blog.*, blog.id as blg_id,
              blog.createdAt as posted_date, COUNT(blog_comments.id) AS comment_count')
              ->join('blog_comments', 'blog_comments.postId = blog.id', 'left')
              ->groupBy('blog.id')
              ->orderBy('blog.id', 'desc')
              ->limit(6)
              ->get()
              ->getResult();
---
SELECT `blog_comments`.*, `blog`.*, `blog`.`id` as `blg_id`, `blog`.`createdAt` as `posted_date`, COUNT(blog_comments.id) AS comment_count
FROM `blog`
LEFT JOIN `blog_comments` ON `blog_comments`.`postId` = `blog`.`id`
GROUP BY `blog`.`id`
ORDER BY `blog`.`id` DESC
 LIMIT 6